// 欄位名稱(目前沒用到)
var columns = [ "交易日期", "收支科目", "捐贈者/支出對象", "身份證/統一編", "收入金額", "支出金額", "金錢類", "地址"];

//可改為外部檔案的位址
var baseURI = '../accounts/'; 
// var baseURI = '//raw.githubusercontent.com/ronnywang/GovCash/master/accounts/'; 

// 各個委員的檔案名稱
// 會產生下拉式選單
// 使用者從下拉式選單選曲之後，會以 baseURI + politicians[n] 的方式讀取資料
var politicians = [

  '第8屆立法委員擬參選人丁守中政治獻金專戶.csv',
  '第8屆立法委員擬參選人王惠美政治獻金專戶.csv',
  '第8屆立法委員擬參選人王進士政治獻金專戶.csv',
  '第8屆立法委員擬參選人江惠貞政治獻金專戶.csv',
  '第8屆立法委員擬參選人吳育昇政治獻金專戶.csv',
  '第8屆立法委員擬參選人李鴻鈞政治獻金專戶.csv',
  '第8屆立法委員擬參選人林德福政治獻金專戶.csv',
  '第8屆立法委員擬參選人林鴻池政治獻金專戶.csv',
  '第8屆立法委員擬參選人徐耀昌政治獻金專戶.csv',
  '第8屆立法委員擬參選人張慶忠政治獻金專戶.csv',
  '第8屆立法委員擬參選人黃昭順政治獻金專戶.csv',
  '第8屆立法委員擬參選人楊瓊瓔政治獻金專戶.csv',
  '第8屆立法委員擬參選人廖正井政治獻金專戶.csv',
  '第8屆立法委員擬參選人潘孟安政治獻金專戶.csv',
  '第8屆立法委員擬參選人蔡正元政治獻金專戶.csv',
  '第8屆立法委員擬參選人蔡錦隆政治獻金專戶.csv',
  '第8屆立法委員擬參選人賴士葆政治獻金專戶.csv',
  '第8屆立法委員擬參選人謝國樑政治獻金專戶.csv',
  '第8屆立法委員擬參選人顏清標政治獻金專戶.csv',
  '第8屆立法委員擬參選人羅明才政治獻金專戶.csv',
  '第8屆立法委員擬參選人蘇震清政治獻金專戶.csv',
  '第八屆立法委員擬參選人費鴻泰政治獻金專戶.csv',
  '第八屆立法委員擬參選人蔣乃辛政治獻金專戶.csv',
  '第1屆新北市市長擬參選人朱立倫政治獻金專戶.csv',
  '第1屆臺南市市長擬參選人賴清德政治獻金專戶.csv'
];

// 用來過濾不需遮掉名字的清單 (目前的規則是四個字以下的捐贈者/支出對象會過濾掉)
var nameExceptions = ['匿名','監察院'];

/* 
The column names of array:
  0: "交易日期"
  1: "收支科目"
  2: "捐贈者/支出對象"
  3: "身份證/統一編"
  4: "收入金額"
  5: "支出金額"
  6: "金錢類"
  7: "地址"

  fakeData = [
      ["2012-02-02 00:00:00","雜支支出","聯合禮品花藝行","19515014",,"6000","是","新北市板橋區"],
      ["2012-02-02 00:00:00","雜支支出","中華電信股份有限公司","92887342",,"59444","是","新北市永和區"],
      ["2012-01-31 00:00:00","雜支支出","聯合報股份有限公司","03799802",,"15120","是","新北市汐止區"],
      ["2012-01-31 00:00:00","雜支支出","汪國國,A12*******",,"120000","是","臺北市松山區"],
      ["2012-01-28 00:00:00","雜支支出","台灣中油公司","36173758",,"14499","是","新北市新莊區"],
      ["2012-01-23 00:00:00","雜支支出","板橋全家福餐飲(股)有限公司","29973105",,"17500","是","新北市板橋區"]
    ];
*/